import abc
import typing


class APISerializableMixin(abc.ABC):
    """
    Используйте, чтобы предоставить возможность передавать
    свои собственные объекты в параметры при вызове API методов.
    По умолчанию для всех объектов, которые не имплементируют
    возможности этого класса или не приспособлены для передачи
    в поле запроса, будет вызван `__str__`
    """

    @abc.abstractmethod
    def represent_as_api_param(self) -> typing.Any:
        """
        Этот метод будет вызван в момент обработки
        параметров, переданных при вызове метода API.

        !!! Note
            При обработке параметров, после вызова этого метода
            значение будет рекурсивно передано в обработчик параметров.

        Returns:
            Любое значение, которое может быть передано
            при отправке API запроса.
        """
